javascript.org
#+TITLE: JavaScript Tutorial
#+AUTHOR: Your Name
# +DATE: 2025-08-02
# +OPTIONS: toc:2 num:nil

#+SETUPFILE:css/emacs-org.setup
[  [[./index.html][Home]] ]  $&ensp;$  | $&ensp;$ $&ensp;$ [text] $&ensp;$  $&ensp;$ | $&ensp;$ $&ensp;$ [link] $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [title] $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [icon] $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [target]  $&ensp;$ $&ensp;$ | $&ensp;$ $&ensp;$ [expanded]  $&ensp;$ $&ensp;$
-----


* Introduction
JavaScript is a versatile programming language primarily used for adding interactivity to websites. This tutorial introduces the basics of JavaScript with code examples.

* Setting Up

To run JavaScript:
- Use your browser's developer tools console.
- Or use an HTML file with a `<script>` tag.
- Or use Node.js for backend or CLI development.

* Variables
** Definition

A variable in programming is a named storage location in a computer’s memory that holds a value, which can be modified during the execution of a program.

Key Points :
- *Name*: Every variable has a name (also called an identifier).
- *Type*: It has a data type (like int, string, float, etc.) that determines the kind of value it can store. \\
  Also Know as =DataTypes=
- *Value*: It holds some data (like a number, text, or boolean).
- *Memory*: It occupies space in memory to store the value.
- *Changeable*: The value stored in a variable can be changed during program execution.

#+begin_src jss
var, let, const  // key word are used to inicilize variable  
  
// Using var is function scoped
var name = "Alice";

// Using let (block-scoped)
let age = 25;

// Using const (constant)
const PI = 3.1415;
#+end_src

** Variable Naming Syntax Convention

JavaScript has specific syntax rules for naming variables:
- Synatx Rule
 - ✅  Allowed 
  - Names must begin with a *letter* (a–z, A–Z), *underscore (_)*, or *dollar sign ($)*.
  - After the first character, digits (0–9) are also allowed.
  - Names are *case-sensitive* (`myVar` ≠ `myvar`).
  - Can use Unicode letters (e.g., Greek, Hindi, Chinese), but it's discouraged for readability.
 - ❌ Not Allowed:
  - Cannot start with a digit.
  - Cannot use *reserved keywords* (like `var`, `let`, `function`, etc.)
  - Cannot contain spaces or hyphens.
 #+begin_src js
let name = "Alice";
let _privateVar = 123;
let $price = 99.99;
let user1 = "John";        // Digits allowed after the first character

let 1user = "Nope";        // ❌ Starts with digit
let let = "invalid";       // ❌ Reserved word
let my-name = "hyphen";    // ❌ Hyphen not allowed
let full name = "space";   // ❌ Space not allowed
#+end_src
- General Rule 
  - For variable and fucntion we use *camelCase* ; eg:userName,, myDate, dateTime, getItem, setItem
  - For Class we use *PascalCase*; eg :Document.getElementById(), 
  - For Constant we use *UPPER_SNAKE_CASE*     
More info: [[https://developer.mozilla.org/en-US/docs/Glossary/Identifier][MDN: JavaScript Identifiers]]

#+begin_src js
// camelCase → Preferred for variables & functions
let firstName = "John";

// PascalCase → Used for class names
class UserProfile {
    constructor(name) {
        this.name = name;
    }
}

// UPPER_SNAKE_CASE → Often used for constants
const MAX_ATTEMPTS = 3;
#+end_src

*** Best Practices
- Use `const` by default, unless you need to reassign.
- Avoid short or vague names like `a`, `b`, `data`.
- Use verbs for functions: `getData()`, `sendRequest()`
- Use nouns for variables/objects: `user`, `emailList`
- Reserved Words to Avoid \\
  eg : `let`, `var`, `const`, `function`, `return`, `if`, `else`, `new`, `class`, etc.

More here: [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Lexical_grammar#keywords][JavaScript Keywords - MDN Docs]]

