javascript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-02 Sat 11:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JavaScript Tutorial</title>
<meta name="author" content="Your Name Karthik D" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="css/jupyter2org.css" />
<link rel="stylesheet" type="text/css" href="css/readtheorg-htmlize.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">JavaScript Tutorial</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org852a388">Introduction</a></li>
<li><a href="#orge38f634">Setting Up</a></li>
<li><a href="#org67ca716">Variables</a>
<ul>
<li><a href="#orgd775105">Definition</a></li>
<li><a href="#org7899640">Variable Naming Syntax Convention</a>
<ul>
<li><a href="#org5f383a3">Best Practices</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org73f1e4d">Data Types</a>
<ul>
<li><a href="#org4ccf603">Number DataType</a>
<ul>
<li><a href="#org87df906">Special Numeric Values</a></li>
<li><a href="#org70cd0eb">Checking for NaN and Finite</a></li>
<li><a href="#org54276fe">Number Limits</a></li>
<li><a href="#orgbf6ae4f">Numeric Literals</a></li>
<li><a href="#orged9ff25">Converting Strings to Numbers</a></li>
<li><a href="#org5ae26fb">Number Formatting</a></li>
<li><a href="#org6b28c77">Operators</a></li>
</ul>
</li>
<li><a href="#orga5c5308">String DataType</a>
<ul>
<li><a href="#org9b7a8bf">Declaring Strings</a></li>
<li><a href="#org659d31b">String Operations</a></li>
<li><a href="#orge0abb60">Accessing Characters</a></li>
<li><a href="#org05356ed">Common String Methods</a></li>
<li><a href="#org23f56ed">Escape Characters</a></li>
<li><a href="#org210a1e8">Template Literals (Backticks)</a></li>
<li><a href="#org5a9c37d">String Immutability</a></li>
<li><a href="#org10ec036">More Info:</a></li>
</ul>
</li>
<li><a href="#org5ec6e02">Boolean DataType</a>
<ul>
<li><a href="#orga0b0dbc">Boolean Expressions</a></li>
<li><a href="#orge1b8409">Boolean Conversion</a></li>
<li><a href="#orge2d783a">Falsy values (convert to false):</a></li>
<li><a href="#org1db5f7a">Everything else is truthy:</a></li>
<li><a href="#org1bd505e">Logical Operators (with Booleans)</a></li>
<li><a href="#orgbdc0094">Boolean Object (Not Recommended)</a></li>
<li><a href="#org0296144">Summary Table</a></li>
<li><a href="#org80e9389">More Info:</a></li>
</ul>
</li>
<li><a href="#org43c4f5e">Null DataType</a></li>
<li><a href="#orgae2521c">Undefined DatType</a></li>
<li><a href="#org16ee79c">Object DataType</a>
<ul>
<li><a href="#orgf077903">Object Methods</a></li>
</ul>
</li>
<li><a href="#org685aed8">Array DataType</a>
<ul>
<li><a href="#org1774e9d">Array Methods</a></li>
</ul>
</li>
<li><a href="#orgd136656">Check Data Type</a></li>
<li><a href="#orgcadbae9">Summary</a></li>
</ul>
</li>
<li><a href="#org7aea051">Functions</a></li>
<li><a href="#org0593383">Control Flow</a></li>
<li><a href="#org9bf4768">Loops</a></li>
<li><a href="#org4c4cb99">Objects and Arrays</a></li>
<li><a href="#org863ce1d"><span class="todo TODO">TODO</span> DOM Manipulation (in browser)</a></li>
<li><a href="#orgcb69df5"><span class="todo TODO">TODO</span> Events</a></li>
<li><a href="#org0dc9d77"><span class="todo TODO">TODO</span> Local Storage</a></li>
<li><a href="#orge651afe">Conclusion</a></li>
</ul>
</div>
</div>
<p>
[  <a href="./index.html">Home</a> ]  \(&ensp;\)  | \(&ensp;\) \(&ensp;\) [text] \(&ensp;\)  \(&ensp;\) | \(&ensp;\) \(&ensp;\) [link] \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [title] \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [icon] \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [target]  \(&ensp;\) \(&ensp;\) | \(&ensp;\) \(&ensp;\) [expanded]  \(&ensp;\) \(&ensp;\)
</p>
<hr />
<div id="outline-container-org852a388" class="outline-2">
<h2 id="org852a388">Introduction</h2>
<div class="outline-text-2" id="text-org852a388">
<p>
JavaScript is a versatile programming language primarily used for adding interactivity to websites. This tutorial introduces the basics of JavaScript with code examples.
</p>
</div>
</div>
<div id="outline-container-orge38f634" class="outline-2">
<h2 id="orge38f634">Setting Up</h2>
<div class="outline-text-2" id="text-orge38f634">
<p>
To run JavaScript:
</p>
<ul class="org-ul">
<li>Use your browser's developer tools console.</li>
<li>Or use an HTML file with a `&lt;script&gt;` tag.</li>
<li>Or use Node.js for backend or CLI development.</li>
</ul>
</div>
</div>
<div id="outline-container-org67ca716" class="outline-2">
<h2 id="org67ca716">Variables</h2>
<div class="outline-text-2" id="text-org67ca716">
</div>
<div id="outline-container-orgd775105" class="outline-3">
<h3 id="orgd775105">Definition</h3>
<div class="outline-text-3" id="text-orgd775105">
<p>
A variable in programming is a named storage location in a computer’s memory that holds a value, which can be modified during the execution of a program.
</p>

<p>
Key Points :
</p>
<ul class="org-ul">
<li><b>Name</b>: Every variable has a name (also called an identifier).</li>
<li><b>Type</b>: It has a data type (like int, string, float, etc.) that determines the kind of value it can store. <br />
Also Know as <code>DataTypes</code></li>
<li><b>Value</b>: It holds some data (like a number, text, or boolean).</li>
<li><b>Memory</b>: It occupies space in memory to store the value.</li>
<li><b>Changeable</b>: The value stored in a variable can be changed during program execution.</li>
</ul>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using var</span>
<span style="color: #3a81c3; font-weight: bold;">var</span> <span style="color: #715ab1;">name</span> = <span style="color: #2d9574;">"Alice"</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using let (block-scoped)</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">age</span> = 25;

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Using const (constant)</span>
<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #715ab1;">PI</span> = 3.1415;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7899640" class="outline-3">
<h3 id="org7899640">Variable Naming Syntax Convention</h3>
<div class="outline-text-3" id="text-org7899640">
<p>
JavaScript has specific syntax rules for naming variables:
</p>
<ul class="org-ul">
<li><p>
Synatx Rule
</p>
<ul class="org-ul">
<li>✅  Allowed 
<ul class="org-ul">
<li>Names must begin with a <b>letter</b> (a–z, A–Z), <b>underscore (_)</b>, or <b>dollar sign ($)</b>.</li>
<li>After the first character, digits (0–9) are also allowed.</li>
<li>Names are <b>case-sensitive</b> (`myVar` ≠ `myvar`).</li>
<li>Can use Unicode letters (e.g., Greek, Hindi, Chinese), but it's discouraged for readability.</li>
</ul></li>
<li>❌ Not Allowed:
<ul class="org-ul">
<li>Cannot start with a digit.</li>
<li>Cannot use <b>reserved keywords</b> (like `var`, `let`, `function`, etc.)</li>
<li>Cannot contain spaces or hyphens.</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">name</span> = <span style="color: #2d9574;">"Alice"</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">_privateVar</span> = 123;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">$price</span> = 99.99;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">user1</span> = <span style="color: #2d9574;">"John"</span>;        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Digits allowed after the first character</span>

<span style="color: #3a81c3; font-weight: bold;">let</span> 1user = <span style="color: #2d9574;">"Nope"</span>;        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10060; Starts with digit</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #3a81c3; font-weight: bold;">let</span> = <span style="color: #2d9574;">"invalid"</span>;       <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10060; Reserved word</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">my</span>-name = <span style="color: #2d9574;">"hyphen"</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10060; Hyphen not allowed</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">full</span> name = <span style="color: #2d9574;">"space"</span>;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&#10060; Space not allowed</span>
</pre>
</div></li>
<li>General Rule 
<ul class="org-ul">
<li>For variable and fucntion we use <b>camelCase</b> ; eg:userName,, myDate, dateTime, getItem, setItem</li>
<li>For Class we use <b>PascalCase</b>; eg :Document.getElementById(),</li>
<li>For Constant we use <b>UPPER_SNAKE_CASE</b></li>
</ul></li>
</ul>
<p>
More info: <a href="https://developer.mozilla.org/en-US/docs/Glossary/Identifier">MDN: JavaScript Identifiers</a>
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">camelCase &#8594; Preferred for variables &amp; functions</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">firstName</span> = <span style="color: #2d9574;">"John"</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">PascalCase &#8594; Used for class names</span>
<span style="color: #3a81c3; font-weight: bold;">class</span> UserProfile <span style="color: #3a81c3;">{</span>
    constructor<span style="color: #6c3163;">(</span>name<span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
        <span style="color: #4e3163;">this</span>.name = name;
    <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">UPPER_SNAKE_CASE &#8594; Often used for constants</span>
<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #715ab1;">MAX_ATTEMPTS</span> = 3;
</pre>
</div>
</div>
<div id="outline-container-org5f383a3" class="outline-4">
<h4 id="org5f383a3">Best Practices</h4>
<div class="outline-text-4" id="text-org5f383a3">
<ul class="org-ul">
<li>Use `const` by default, unless you need to reassign.</li>
<li>Avoid short or vague names like `a`, `b`, `data`.</li>
<li>Use verbs for functions: `getData()`, `sendRequest()`</li>
<li>Use nouns for variables/objects: `user`, `emailList`</li>
<li>Reserved Words to Avoid <br />
eg : `let`, `var`, `const`, `function`, `return`, `if`, `else`, `new`, `class`, etc.</li>
</ul>

<p>
More here: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Lexical_grammar#keywords">JavaScript Keywords - MDN Docs</a>
</p>
</div>
</div>
</div>
</div>
