javascript.org
* Data Types

JavaScript supports several data types (Null, Undefined, Boolean, Number, String, Object, Array(simillar to list in python))
#+begin_src js
let str = "Hello";      // String
let num = 42;           // Number (no difference between integer, float)
let isTrue = true;      // Boolean
let nothing = null;     // Null
let notDefined;         // Undefined
let obj = {x: 1, y: 2}; // Object
let arr = [1, 2, 3];    // Array
#+end_src
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures][MDN: JavaScript Data Types]]
** Number DataType
JavaScript uses a single `Number` type for all numeric values — including integers and floating-point numbers. Internally, all numbers are stored as *64-bit floating-point (IEEE 754)*.
- Examples
#+begin_src js
let age = 25;          // Integer
let price = 99.99;     // Floating-point
let negative = -100;   // Negative number
let pi = 3.1415926535; // Decimal
#+end_src

*** Special Numeric Values

| Value       | Meaning                         |
|-------------+----------------------------------|
| `Infinity`  | Positive infinity                |
| `-Infinity` | Negative infinity                |
| `NaN`       | "Not-a-Number" (invalid result) |

#+begin_src js
console.log(1 / 0);       // Infinity
console.log(-1 / 0);      // -Infinity
console.log("abc" * 3);   // NaN
#+end_src

*** Checking for NaN and Finite

#+begin_src js
isNaN("hello");         // true
isNaN(123);             // false
Number.isNaN(NaN);      // true

isFinite(10);           // true
isFinite(Infinity);     // false
#+end_src

*** Number Limits

JavaScript has some numeric precision and size limits:

#+begin_src js
console.log(Number.MAX_VALUE);        // Largest positive number
console.log(Number.MIN_VALUE);        // Smallest positive number > 0
console.log(Number.MAX_SAFE_INTEGER); // 2^53 - 1
console.log(Number.MIN_SAFE_INTEGER); // -(2^53 - 1)
#+end_src
*** Numeric Literals

| Syntax        | Example     |
|---------------+-------------|
| Decimal       | `123`       |
| Binary (0b)   | `0b1010`    |
| Octal (0o)    | `0o755`     |
| Hex (0x)      | `0xFF`      |

#+begin_src js
let dec = 255;
let bin = 0b11111111;
let oct = 0o377;
let hex = 0xFF;

console.log(dec === bin); // true
#+end_src

*** Converting Strings to Numbers

#+begin_src js
Number("42");         // 42
parseInt("42px");     // 42
parseFloat("3.14m");  // 3.14
+"123";               // 123 (unary plus)
#+end_src

*** Number Formatting

#+begin_src js
let n = 12345.6789;

n.toFixed(2);     // "12345.68" — 2 decimal places
n.toPrecision(4); // "1.235e+4"
n.toString();     // "12345.6789"
#+end_src

- More Info:
 - [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures#number_type][MDN: Number Type]]
 - [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Number][MDN: Number Object]]

*** Operators
JavaScript supports standard arithmetic operators to perform calculations on numbers.
