javascript.html
<div id="outline-container-org73f1e4d" class="outline-2">
<h2 id="org73f1e4d">Data Types</h2>
<div class="outline-text-2" id="text-org73f1e4d">
<p>
JavaScript supports several data types (Null, Undefined, Boolean, Number, String, Object, Array(simillar to list in python))
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">str</span> = <span style="color: #2d9574;">"Hello"</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">String</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">num</span> = 42;           <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Number (no difference between integer, float)</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">isTrue</span> = <span style="color: #4e3163;">true</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Boolean</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">nothing</span> = <span style="color: #4e3163;">null</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Null</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">notDefined</span>;         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Undefined</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">obj</span> = <span style="color: #3a81c3;">{</span>x: 1, y: 2<span style="color: #3a81c3;">}</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Object</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">arr</span> = <span style="color: #3a81c3;">[</span>1, 2, 3<span style="color: #3a81c3;">]</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Array</span>
</pre>
</div>
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures">MDN: JavaScript Data Types</a></li>
</ul>
</div>
<div id="outline-container-org4ccf603" class="outline-3">
<h3 id="org4ccf603">Number DataType</h3>
<div class="outline-text-3" id="text-org4ccf603">
<p>
JavaScript uses a single `Number` type for all numeric values — including integers and floating-point numbers. Internally, all numbers are stored as <b>64-bit floating-point (IEEE 754)</b>.
</p>
<ul class="org-ul">
<li>Examples</li>
</ul>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">age</span> = 25;          <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Integer</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">price</span> = 99.99;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Floating-point</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">negative</span> = -100;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Negative number</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">pi</span> = 3.1415926535; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Decimal</span>
</pre>
</div>
</div>
<div id="outline-container-org87df906" class="outline-4">
<h4 id="org87df906">Special Numeric Values</h4>
<div class="outline-text-4" id="text-org87df906">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`Infinity`</td>
<td class="org-left">Positive infinity</td>
</tr>

<tr>
<td class="org-left">`-Infinity`</td>
<td class="org-left">Negative infinity</td>
</tr>

<tr>
<td class="org-left">`NaN`</td>
<td class="org-left">"Not-a-Number" (invalid result)</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span>1 / 0<span style="color: #3a81c3;">)</span>;       <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Infinity</span>
console.log<span style="color: #3a81c3;">(</span>-1 / 0<span style="color: #3a81c3;">)</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">-Infinity</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"abc"</span> * 3<span style="color: #3a81c3;">)</span>;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">NaN</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org70cd0eb" class="outline-4">
<h4 id="org70cd0eb">Checking for NaN and Finite</h4>
<div class="outline-text-4" id="text-org70cd0eb">
<div class="org-src-container">
<pre class="src src-js">isNaN<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"hello"</span><span style="color: #3a81c3;">)</span>;         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
isNaN<span style="color: #3a81c3;">(</span>123<span style="color: #3a81c3;">)</span>;             <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
Number.isNaN<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">NaN</span><span style="color: #3a81c3;">)</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>

isFinite<span style="color: #3a81c3;">(</span>10<span style="color: #3a81c3;">)</span>;           <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
isFinite<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">Infinity</span><span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org54276fe" class="outline-4">
<h4 id="org54276fe">Number Limits</h4>
<div class="outline-text-4" id="text-org54276fe">
<p>
JavaScript has some numeric precision and size limits:
</p>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span>Number.MAX_VALUE<span style="color: #3a81c3;">)</span>;        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Largest positive number</span>
console.log<span style="color: #3a81c3;">(</span>Number.MIN_VALUE<span style="color: #3a81c3;">)</span>;        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Smallest positive number &gt; 0</span>
console.log<span style="color: #3a81c3;">(</span>Number.MAX_SAFE_INTEGER<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">2^53 - 1</span>
console.log<span style="color: #3a81c3;">(</span>Number.MIN_SAFE_INTEGER<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">-(2^53 - 1)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf6ae4f" class="outline-4">
<h4 id="orgbf6ae4f">Numeric Literals</h4>
<div class="outline-text-4" id="text-orgbf6ae4f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Syntax</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Decimal</td>
<td class="org-left">`123`</td>
</tr>

<tr>
<td class="org-left">Binary (0b)</td>
<td class="org-left">`0b1010`</td>
</tr>

<tr>
<td class="org-left">Octal (0o)</td>
<td class="org-left">`0o755`</td>
</tr>

<tr>
<td class="org-left">Hex (0x)</td>
<td class="org-left">`0xFF`</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">dec</span> = 255;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">bin</span> = 0b11111111;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">oct</span> = 0o377;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">hex</span> = 0xFF;

console.log<span style="color: #3a81c3;">(</span>dec === bin<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orged9ff25" class="outline-4">
<h4 id="orged9ff25">Converting Strings to Numbers</h4>
<div class="outline-text-4" id="text-orged9ff25">
<div class="org-src-container">
<pre class="src src-js">Number<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"42"</span><span style="color: #3a81c3;">)</span>;         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">42</span>
parseInt<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"42px"</span><span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">42</span>
parseFloat<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"3.14m"</span><span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">3.14</span>
+<span style="color: #2d9574;">"123"</span>;               <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">123 (unary plus)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5ae26fb" class="outline-4">
<h4 id="org5ae26fb">Number Formatting</h4>
<div class="outline-text-4" id="text-org5ae26fb">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">n</span> = 12345.6789;

n.toFixed<span style="color: #3a81c3;">(</span>2<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"12345.68" &#8212; 2 decimal places</span>
n.toPrecision<span style="color: #3a81c3;">(</span>4<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"1.235e+4"</span>
n.toString<span style="color: #3a81c3;">()</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"12345.6789"</span>
</pre>
</div>

<ul class="org-ul">
<li>More Info:
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures#number_type">MDN: Number Type</a></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Number">MDN: Number Object</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6b28c77" class="outline-4">
<h4 id="org6b28c77">Operators</h4>
<div class="outline-text-4" id="text-org6b28c77">
<p>
JavaScript supports standard arithmetic operators to perform calculations on numbers.
</p>
</div>
<ul class="org-ul">
