javascript.org
**** 1) Arthimetic operator


| Operator | Description     | Example        | Result |
|----------+-----------------+----------------+--------|
| +        | Addition         | 5 + 3          | 8      |
| -        | Subtraction      | 10 - 4         | 6      |
| *        | Multiplication   | 7 * 2          | 14     |
| /        | Division         | 12 / 3         | 4      |
| %        | Modulus (Remainder) | 10 % 3     | 1      |
| **       | Exponentiation   | 2 ** 3         | 8      |

#+begin_src js
let a = 10, b = 3;

console.log(a + b);  // 13
console.log(a - b);  // 7
console.log(a * b);  // 30
console.log(a / b);  // 3.333...
console.log(a % b);  // 1
console.log(a ** b); // 1000
#+end_src

#+begin_quote
- JavaScript uses *floating-point arithmetic* — results may not always be exact (e.g. `0.1 + 0.2 !== 0.3`).
- Use `Math` functions (e.g. `Math.floor()`, `Math.round()`, `Math.sqrt()`) for advanced numeric operations.
#+end_quote
More on this: [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Expressions_and_Operators#arithmetic_operators][MDN: Arithmetic Operators]]
**** 2) Assignment Operator (Increment and Decrement) 

| Operator | Description         | Example        |
|----------+---------------------+----------------|
| ++       | Increment by 1      | x++ or ++x     |
| --       | Decrement by 1      | x-- or --x     |

#+begin_src js
let x = 5;

console.log(x++); // 5 (then x becomes 6)
console.log(++x); // 7 (x is incremented before)
console.log(x--); // 7 (then x becomes 6)
console.log(--x); // 5
#+end_src

**** 3) Assignment Operator  (Compound Assignment) 

| Operator | Example     | Equivalent To   |
|----------+-------------+-----------------|
| +=       | x += 3      | x = x + 3       |
| -=       | x -= 2      | x = x - 2       |
| *=       | x *= 4      | x = x * 4       |
| /=       | x /= 2      | x = x / 2       |
| %=       | x %= 5      | x = x % 5       |
| **=      | x **= 2     | x = x ** 2      |

#+begin_src js
let y = 4;

y += 2;  // 6
y *= 3;  // 18
y **= 2; // 324
console.log(y);
#+end_src

**** 4) Comparison operator
JavaScript provides several comparison operators for comparing numbers and other values. These operators return boolean results: `true` or `false`.

| Operator | Name                    | Example     | Result     |
|----------+-------------------------+-------------+------------|
| `==`     | Equal to (loose)        | 5 `==` '5'  | true       |
| `===`    | Equal to (strict)       | 5 `===` '5'  | false      |
| !=       | Not equal (loose)       | 5 != '5'    | false      |
| !==      | Not equal (strict)      | 5 !== '5'   | true       |
| >        | Greater than            | 7 > 3       | true       |
| <        | Less than               | 2 < 4       | true       |
| >=       | Greater than or equal   | 5 >= 5      | true       |
| <=       | Less than or equal      | 3 <= 2      | false      |

#+begin_src js
let a = 10;
let b = 5;

console.log(a > b);     // true
console.log(a < b);     // false
console.log(a == "10"); // true (loose equality)
console.log(a === "10");// false (strict equality)
console.log(a != b);    // true
console.log(a !== 10);  // false
#+end_src

