javascript.html
<li><a id="orgab1dd82"></a>1) Arthimetic operator<br />
<div class="outline-text-5" id="text-orgab1dd82">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-right">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">+</td>
<td class="org-left">Addition</td>
<td class="org-left">5 + 3</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">Subtraction</td>
<td class="org-left">10 - 4</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">Multiplication</td>
<td class="org-left">7 * 2</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">%</td>
<td class="org-left">Modulus (Remainder)</td>
<td class="org-left">10 % 3</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">**</td>
<td class="org-left">Exponentiation</td>
<td class="org-left">2 ** 3</td>
<td class="org-right">8</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">a</span> = 10, <span style="color: #715ab1;">b</span> = 3;

console.log<span style="color: #3a81c3;">(</span>a + b<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">13</span>
console.log<span style="color: #3a81c3;">(</span>a - b<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">7</span>
console.log<span style="color: #3a81c3;">(</span>a * b<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">30</span>
console.log<span style="color: #3a81c3;">(</span>a / b<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">3.333...</span>
console.log<span style="color: #3a81c3;">(</span>a % b<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">1</span>
console.log<span style="color: #3a81c3;">(</span>a ** b<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">1000</span>
</pre>
</div>

<blockquote>
<ul class="org-ul">
<li>JavaScript uses <b>floating-point arithmetic</b> — results may not always be exact (e.g. `0.1 + 0.2 !== 0.3`).</li>
<li>Use `Math` functions (e.g. `Math.floor()`, `Math.round()`, `Math.sqrt()`) for advanced numeric operations.</li>
</ul>
</blockquote>
<p>
More on this: <a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Expressions_and_Operators#arithmetic_operators">MDN: Arithmetic Operators</a>
</p>
</div>
</li>
<li><a id="org01394fe"></a>2) Assignment Operator (Increment and Decrement)<br />
<div class="outline-text-5" id="text-org01394fe">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">++</td>
<td class="org-left">Increment by 1</td>
<td class="org-left">x++ or ++x</td>
</tr>

<tr>
<td class="org-left">--</td>
<td class="org-left">Decrement by 1</td>
<td class="org-left">x&#x2013; or &#x2013;x</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">x</span> = 5;

console.log<span style="color: #3a81c3;">(</span>x++<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">5 (then x becomes 6)</span>
console.log<span style="color: #3a81c3;">(</span>++x<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">7 (x is incremented before)</span>
console.log<span style="color: #3a81c3;">(</span>x--<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">7 (then x becomes 6)</span>
console.log<span style="color: #3a81c3;">(</span>--x<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">5</span>
</pre>
</div>
</div>
</li>
<li><a id="org617c604"></a>3) Assignment Operator  (Compound Assignment)<br />
<div class="outline-text-5" id="text-org617c604">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Equivalent To</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">+=</td>
<td class="org-left">x += 3</td>
<td class="org-left">x = x + 3</td>
</tr>

<tr>
<td class="org-left">-=</td>
<td class="org-left">x -= 2</td>
<td class="org-left">x = x - 2</td>
</tr>

<tr>
<td class="org-left">*=</td>
<td class="org-left">x *= 4</td>
<td class="org-left">x = x * 4</td>
</tr>

<tr>
<td class="org-left">/=</td>
<td class="org-left">x /= 2</td>
<td class="org-left">x = x / 2</td>
</tr>

<tr>
<td class="org-left">%=</td>
<td class="org-left">x %= 5</td>
<td class="org-left">x = x % 5</td>
</tr>

<tr>
<td class="org-left">**=</td>
<td class="org-left">x **= 2</td>
<td class="org-left">x = x ** 2</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">y</span> = 4;

y += 2;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">6</span>
y *= 3;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">18</span>
y **= 2; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">324</span>
console.log<span style="color: #3a81c3;">(</span>y<span style="color: #3a81c3;">)</span>;
</pre>
</div>
</div>
</li>
<li><a id="orgf7021d4"></a>4) Comparison operator<br />
<div class="outline-text-5" id="text-orgf7021d4">
<p>
JavaScript provides several comparison operators for comparing numbers and other values. These operators return boolean results: `true` or `false`.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`==`</td>
<td class="org-left">Equal to (loose)</td>
<td class="org-left">5 `==` '5'</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">`===`</td>
<td class="org-left">Equal to (strict)</td>
<td class="org-left">5 `===` '5'</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">!=</td>
<td class="org-left">Not equal (loose)</td>
<td class="org-left">5 != '5'</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">!==</td>
<td class="org-left">Not equal (strict)</td>
<td class="org-left">5 !== '5'</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">&gt;</td>
<td class="org-left">Greater than</td>
<td class="org-left">7 &gt; 3</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">&lt;</td>
<td class="org-left">Less than</td>
<td class="org-left">2 &lt; 4</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">&gt;=</td>
<td class="org-left">Greater than or equal</td>
<td class="org-left">5 &gt;= 5</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">&lt;=</td>
<td class="org-left">Less than or equal</td>
<td class="org-left">3 &lt;= 2</td>
<td class="org-left">false</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">a</span> = 10;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">b</span> = 5;

console.log<span style="color: #3a81c3;">(</span>a &gt; b<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>a &lt; b<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
console.log<span style="color: #3a81c3;">(</span>a == <span style="color: #2d9574;">"10"</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true (loose equality)</span>
console.log<span style="color: #3a81c3;">(</span>a === <span style="color: #2d9574;">"10"</span><span style="color: #3a81c3;">)</span>;<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false (strict equality)</span>
console.log<span style="color: #3a81c3;">(</span>a != b<span style="color: #3a81c3;">)</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>a !== 10<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
</pre>
</div>
</div>
<ul class="org-ul">
