javascript.org
***** Loose vs Strict Comparison

- `==` and `!=` perform *type coercion* (i.e., convert types before comparing).
- `===` and `!==` do *not* convert types — both value and type must match.

#+begin_src js
console.log(5 == "5");   // true (number vs string, coerced)
console.log(5 === "5");  // false (different types)
console.log(null == undefined);  // true
console.log(null === undefined); // false
#+end_src

#+begin_quote
*Always use `===` and `!==`* unless you explicitly want type coercion.
#+end_quote Best Practice



- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators][MDN: Comparison Operators]]


**** 5) Conditional (Ternary) Operator

#+BEGIN_SRC js
    const age = 23;
    // age >= 18 ? console.log('I like to drink wine 🍷') : console.log('I like to drink water 💧');

    const drink = age >= 18 ? 'Sharbat-e-Jaam 🍷' : 'water 💧';
    console.log(drink);

    let drink2;
    if (age >= 18) {
      drink2 = 'Sharbat-e-Jaam 🍷';
    } else {
      drink2 = 'water 💧';
    }
    console.log(drink2);

    console.log(`I like to drink ${age >= 18 ? 'Sharbat-e-Jaam 🍷' : 'water 💧'}`);
#+END_SRC

**** 6) Logical Operators 

Logical operators are used to combine or invert boolean values. While they work with any data type (not just numbers), they are especially useful in conditions involving numeric comparisons.

#+BEGIN_EXPORT html
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&amp;&amp;</td>
<td class="org-left">Logical AND</td>
<td class="org-left">(5 &gt; 3) &amp;&amp; (2 &lt; 4)</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">&nbsp;||</td>
<td class="org-left">Logical OR</td>
<td class="org-left">(5 &gt; 6) || (2 &lt; 4)</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">Logical NOT</td>
<td class="org-left">!(5 &gt; 3)</td>
<td class="org-left">false</td>
</tr>
</tbody>
</table>

#+END_EXPORT



#+begin_src js
let a = 10;
let b = 5;

console.log(a > 5 && b < 10); // true (both true)
console.log(a < 5 || b < 10); // true (one is true)
console.log(!(a == 10));      // false (negation)

#+end_src

**** Truthy and Falsy in JavaScript

JavaScript treats certain values as "truthy" or "falsy" in logical expressions.

- *Falsy values:* `false`, `0`, `-0`, `""` (empty string), `null`, `undefined`, `NaN`
- *Everything else is truthy* — including `"0"`, `[]`, `{}`, etc.

#+begin_src js
console.log(0 && 100);     // 0 (falsy short-circuits)
console.log(100 && 0);     // 0 (returns first falsy)
console.log(100 && 200);   // 200 (both truthy)

console.log(0 || 200);     // 200 (returns first truthy)
console.log(100 || 0);     // 100 (first is truthy)

console.log(!0);           // true
console.log(!100);         // false
#+end_src

**** Short-Circuit Evaluation

- `&&` returns the first falsy value (or the last if none are falsy).
- `||` returns the first truthy value.

Example:  Real-world Use Case

#+begin_src js
let username = inputName || "Guest";  // default value
let isValid = score > 0 && score <= 100;
#+end_src

- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Logical_Operators][MDN: Logical Operators]]
**** TODO 5)  Bitwise  operator
  | or         |    |
  | and        | &  |
  | xor        | ^  |
  | RIGHTSHIFT | >> |
  | Leftshift  | << |
  |            |    |
#+BEGIN_SRC python

 #+END_SRC
**** TODO 7) Membership  operator 
#+BEGIN_SRC python

#+END_SRC
** String DataType
A `String` in JavaScript is a sequence of characters used to represent text. Strings are immutable — once created, they cannot be changed (only replaced).

*** Declaring Strings

You can use single quotes (`'`), double quotes (`"`), or backticks (`` ` ``) for template literals.

#+begin_src js
let name1 = "Alice";
let name2 = 'Bob';
let name3 = `Charlie`; // Template literal
#+end_src

