javascript.html
<li><a id="org51fb0fa"></a>Loose vs Strict Comparison<br />
<div class="outline-text-6" id="text-org51fb0fa">
<ul class="org-ul">
<li>`==` and `!=` perform <b>type coercion</b> (i.e., convert types before comparing).</li>
<li>`===` and `!==` do <b>not</b> convert types — both value and type must match.</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span>5 == <span style="color: #2d9574;">"5"</span><span style="color: #3a81c3;">)</span>;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true (number vs string, coerced)</span>
console.log<span style="color: #3a81c3;">(</span>5 === <span style="color: #2d9574;">"5"</span><span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false (different types)</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">null</span> == <span style="color: #4e3163;">undefined</span><span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">null</span> === <span style="color: #4e3163;">undefined</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
</pre>
</div>

<p>
#+begin_quote
<b>Always use `===` and `!==`</b> unless you explicitly want type coercion.
#+end_quote Best Practice
</p>



<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Comparison_Operators">MDN: Comparison Operators</a></li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="org99f87dc"></a>5) Logical Operators<br />
<div class="outline-text-5" id="text-org99f87dc">
<p>
Logical operators are used to combine or invert boolean values. While they work with any data type (not just numbers), they are especially useful in conditions involving numeric comparisons.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="org-left">

<col class="org-left">

<col class="org-left">

<col class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&amp;&amp;</td>
<td class="org-left">Logical AND</td>
<td class="org-left">(5 &gt; 3) &amp;&amp; (2 &lt; 4)</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">&nbsp;||</td>
<td class="org-left">Logical OR</td>
<td class="org-left">(5 &gt; 6) || (2 &lt; 4)</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">!</td>
<td class="org-left">Logical NOT</td>
<td class="org-left">!(5 &gt; 3)</td>
<td class="org-left">false</td>
</tr>
</tbody>
</table>



<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">a</span> = 10;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">b</span> = 5;

console.log<span style="color: #3a81c3;">(</span>a &gt; 5 &amp;&amp; b &lt; 10<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true (both true)</span>
console.log<span style="color: #3a81c3;">(</span>a &lt; 5 || b &lt; 10<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true (one is true)</span>
console.log<span style="color: #3a81c3;">(</span>!<span style="color: #6c3163;">(</span>a == 10<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false (negation)</span>

</pre>
</div>
</div>
</li>
<li><a id="org916ca78"></a>Truthy and Falsy in JavaScript<br />
<div class="outline-text-5" id="text-org916ca78">
<p>
JavaScript treats certain values as "truthy" or "falsy" in logical expressions.
</p>

<ul class="org-ul">
<li><b>Falsy values:</b> `false`, `0`, `-0`, `""` (empty string), `null`, `undefined`, `NaN`</li>
<li><b>Everything else is truthy</b> — including `"0"`, `[]`, `{}`, etc.</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span>0 &amp;&amp; 100<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">0 (falsy short-circuits)</span>
console.log<span style="color: #3a81c3;">(</span>100 &amp;&amp; 0<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">0 (returns first falsy)</span>
console.log<span style="color: #3a81c3;">(</span>100 &amp;&amp; 200<span style="color: #3a81c3;">)</span>;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">200 (both truthy)</span>

console.log<span style="color: #3a81c3;">(</span>0 || 200<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">200 (returns first truthy)</span>
console.log<span style="color: #3a81c3;">(</span>100 || 0<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">100 (first is truthy)</span>

console.log<span style="color: #3a81c3;">(</span>!0<span style="color: #3a81c3;">)</span>;           <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>!100<span style="color: #3a81c3;">)</span>;         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
</pre>
</div>
</div>
</li>
<li><a id="orgf402d17"></a>Short-Circuit Evaluation<br />
<div class="outline-text-5" id="text-orgf402d17">
<ul class="org-ul">
<li>`&amp;&amp;` returns the first falsy value (or the last if none are falsy).</li>
<li>`||` returns the first truthy value.</li>
</ul>

<p>
Example:  Real-world Use Case
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">username</span> = inputName || <span style="color: #2d9574;">"Guest"</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">default value</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">isValid</span> = score &gt; 0 &amp;&amp; score &lt;= 100;
</pre>
</div>

<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Logical_Operators">MDN: Logical Operators</a></li>
</ul>
</div>
</li>
<li><a id="orga290153"></a><span class="todo TODO">TODO</span> 5)  Bitwise  operator<br />
<div class="outline-text-5" id="text-orga290153">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">or</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">and</td>
<td class="org-left">&amp;</td>
</tr>

<tr>
<td class="org-left">xor</td>
<td class="org-left">^</td>
</tr>

<tr>
<td class="org-left">RIGHTSHIFT</td>
<td class="org-left">&gt;&gt;</td>
</tr>

<tr>
<td class="org-left">Leftshift</td>
<td class="org-left">&lt;&lt;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-python">
</pre>
</div>
</div>
</li>
<li><a id="orgcf2f097"></a><span class="todo TODO">TODO</span> 7) Membership  operator<br />
<div class="outline-text-5" id="text-orgcf2f097">
<div class="org-src-container">
<pre class="src src-python">
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga5c5308" class="outline-3">
<h3 id="orga5c5308">String DataType</h3>
<div class="outline-text-3" id="text-orga5c5308">
<p>
A `String` in JavaScript is a sequence of characters used to represent text. Strings are immutable — once created, they cannot be changed (only replaced).
</p>
</div>
<div id="outline-container-org9b7a8bf" class="outline-4">
<h4 id="org9b7a8bf">Declaring Strings</h4>
<div class="outline-text-4" id="text-org9b7a8bf">
<p>
You can use single quotes (`'`), double quotes (`"`), or backticks (`` ` ``) for template literals.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">name1</span> = <span style="color: #2d9574;">"Alice"</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">name2</span> = <span style="color: #2d9574;">'Bob'</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">name3</span> = <span style="color: #2d9574;">`Charlie`</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Template literal</span>
</pre>
</div>
</div>
</div>
