javascript.org
*** String Operations

#+begin_src js
let first = "Hello";
let second = "World";

// Concatenation
let result = first + " " + second; // "Hello World"

// Template literals
let greeting = `Hi, ${name1}!`; // "Hi, Alice!"

// Length of a string
console.log(greeting.length); // 10
#+end_src

*** Accessing Characters

JavaScript strings are zero-indexed.

#+begin_src js
let text = "JavaScript";

console.log(text[0]);     // "J"
console.log(text.charAt(4)); // "S"
console.log(text[text.length - 1]); // "t"
#+end_src

*** Common String Methods

| Method              | Description                            | Example                         |
|---------------------+----------------------------------------+----------------------------------|
| `length`            | Returns string length                  | `"abc".length` → 3              |
| `toUpperCase()`     | Converts to uppercase                  | `"hello".toUpperCase()` → "HELLO" |
| `toLowerCase()`     | Converts to lowercase                  | `"HELLO".toLowerCase()` → "hello" |
| `trim()`            | Removes whitespace                     | `"  hi  ".trim()` → "hi"        |
| `includes()`        | Checks if substring exists             | `"abc".includes("b")` → true    |
| `indexOf()`         | Returns first index of substring       | `"hello".indexOf("l")` → 2      |
| `lastIndexOf()`     | Returns last index of substring        | `"hello".lastIndexOf("l")` → 3  |
| `slice(start, end)` | Extracts part of string                | `"hello".slice(1, 3)` → "el"    |
| `substring(start, end)` | Similar to slice                   | `"hello".substring(1, 3)` → "el"|
| `replace()`         | Replaces first match                   | `"Hi Joe".replace("Joe", "Sam")`|
| `split()`           | Splits string into array               | `"a,b,c".split(",")` → `["a","b","c"]` |
| `repeat()`          | Repeats the string                     | `"ha".repeat(3)` → "hahaha"     |

#+begin_src js
let str = "  JavaScript is fun!  ";

console.log(str.trim());             // "JavaScript is fun!"
console.log(str.toUpperCase());     // "  JAVASCRIPT IS FUN!  "
console.log(str.includes("fun"));   // true
console.log(str.indexOf("Script")); // 4
console.log(str.slice(2, 12));      // "JavaScript"
console.log(str.replace("fun", "awesome")); // "  JavaScript is awesome!  "
#+end_src

*** Escape Characters

| Escape | Meaning         |
|--------+-----------------|
| `\'`   | Single quote    |
| `\"`   | Double quote    |
| `\\`   | Backslash       |
| `\n`   | New line        |
| `\t`   | Tab             |

#+begin_src js
let msg = "Line1\nLine2";
console.log(msg);
/* Output:
Line1
Line2
*/
#+end_src

*** Template Literals (Backticks)

Allows embedded expressions and multi-line strings.

#+begin_src js
let user = "Karthik";
let greeting = `Welcome, ${user}!`;
let multiLine = `Line 1
Line 2`;

console.log(greeting); // "Welcome, Karthik!"
console.log(multiLine);
#+end_src

*** String Immutability

Strings are immutable in JavaScript — operations create a new string.

#+begin_src js
let original = "hello";
let upper = original.toUpperCase();

console.log(original); // "hello" (unchanged)
console.log(upper);    // "HELLO"
#+end_src

*** More Info:
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String][MDN: String Reference]]

