javascript.html
<div id="outline-container-org659d31b" class="outline-4">
<h4 id="org659d31b">String Operations</h4>
<div class="outline-text-4" id="text-org659d31b">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">first</span> = <span style="color: #2d9574;">"Hello"</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">second</span> = <span style="color: #2d9574;">"World"</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Concatenation</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">result</span> = first + <span style="color: #2d9574;">" "</span> + second; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"Hello World"</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Template literals</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">greeting</span> = <span style="color: #2d9574;">`Hi, ${name1}!`</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"Hi, Alice!"</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Length of a string</span>
console.log<span style="color: #3a81c3;">(</span>greeting.length<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">10</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0abb60" class="outline-4">
<h4 id="orge0abb60">Accessing Characters</h4>
<div class="outline-text-4" id="text-orge0abb60">
<p>
JavaScript strings are zero-indexed.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">text</span> = <span style="color: #2d9574;">"JavaScript"</span>;

console.log<span style="color: #3a81c3;">(</span>text<span style="color: #6c3163;">[</span>0<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"J"</span>
console.log<span style="color: #3a81c3;">(</span>text.charAt<span style="color: #6c3163;">(</span>4<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"S"</span>
console.log<span style="color: #3a81c3;">(</span>text<span style="color: #6c3163;">[</span>text.length - 1<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"t"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org05356ed" class="outline-4">
<h4 id="org05356ed">Common String Methods</h4>
<div class="outline-text-4" id="text-org05356ed">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`length`</td>
<td class="org-left">Returns string length</td>
<td class="org-left">`"abc".length` → 3</td>
</tr>

<tr>
<td class="org-left">`toUpperCase()`</td>
<td class="org-left">Converts to uppercase</td>
<td class="org-left">`"hello".toUpperCase()` → "HELLO"</td>
</tr>

<tr>
<td class="org-left">`toLowerCase()`</td>
<td class="org-left">Converts to lowercase</td>
<td class="org-left">`"HELLO".toLowerCase()` → "hello"</td>
</tr>

<tr>
<td class="org-left">`trim()`</td>
<td class="org-left">Removes whitespace</td>
<td class="org-left">`"  hi  ".trim()` → "hi"</td>
</tr>

<tr>
<td class="org-left">`includes()`</td>
<td class="org-left">Checks if substring exists</td>
<td class="org-left">`"abc".includes("b")` → true</td>
</tr>

<tr>
<td class="org-left">`indexOf()`</td>
<td class="org-left">Returns first index of substring</td>
<td class="org-left">`"hello".indexOf("l")` → 2</td>
</tr>

<tr>
<td class="org-left">`lastIndexOf()`</td>
<td class="org-left">Returns last index of substring</td>
<td class="org-left">`"hello".lastIndexOf("l")` → 3</td>
</tr>

<tr>
<td class="org-left">`slice(start, end)`</td>
<td class="org-left">Extracts part of string</td>
<td class="org-left">`"hello".slice(1, 3)` → "el"</td>
</tr>

<tr>
<td class="org-left">`substring(start, end)`</td>
<td class="org-left">Similar to slice</td>
<td class="org-left">`"hello".substring(1, 3)` → "el"</td>
</tr>

<tr>
<td class="org-left">`replace()`</td>
<td class="org-left">Replaces first match</td>
<td class="org-left">`"Hi Joe".replace("Joe", "Sam")`</td>
</tr>

<tr>
<td class="org-left">`split()`</td>
<td class="org-left">Splits string into array</td>
<td class="org-left">`"a,b,c".split(",")` → `["a","b","c"]`</td>
</tr>

<tr>
<td class="org-left">`repeat()`</td>
<td class="org-left">Repeats the string</td>
<td class="org-left">`"ha".repeat(3)` → "hahaha"</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">str</span> = <span style="color: #2d9574;">"  JavaScript is fun!  "</span>;

console.log<span style="color: #3a81c3;">(</span>str.trim<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>;             <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"JavaScript is fun!"</span>
console.log<span style="color: #3a81c3;">(</span>str.toUpperCase<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"  JAVASCRIPT IS FUN!  "</span>
console.log<span style="color: #3a81c3;">(</span>str.includes<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"fun"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>str.indexOf<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Script"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">4</span>
console.log<span style="color: #3a81c3;">(</span>str.slice<span style="color: #6c3163;">(</span>2, 12<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"JavaScript"</span>
console.log<span style="color: #3a81c3;">(</span>str.replace<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"fun"</span>, <span style="color: #2d9574;">"awesome"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"  JavaScript is awesome!  "</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org23f56ed" class="outline-4">
<h4 id="org23f56ed">Escape Characters</h4>
<div class="outline-text-4" id="text-org23f56ed">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Escape</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`\'`</td>
<td class="org-left">Single quote</td>
</tr>

<tr>
<td class="org-left">`\"`</td>
<td class="org-left">Double quote</td>
</tr>

<tr>
<td class="org-left">`\\`</td>
<td class="org-left">Backslash</td>
</tr>

<tr>
<td class="org-left">`\n`</td>
<td class="org-left">New line</td>
</tr>

<tr>
<td class="org-left">`\t`</td>
<td class="org-left">Tab</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">msg</span> = <span style="color: #2d9574;">"Line1\nLine2"</span>;
console.log<span style="color: #3a81c3;">(</span>msg<span style="color: #3a81c3;">)</span>;
<span style="color: #2aa1ae; background-color: #ecf3ec;">/* </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Output:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">Line1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">Line2</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">*/</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org210a1e8" class="outline-4">
<h4 id="org210a1e8">Template Literals (Backticks)</h4>
<div class="outline-text-4" id="text-org210a1e8">
<p>
Allows embedded expressions and multi-line strings.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">user</span> = <span style="color: #2d9574;">"Karthik"</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">greeting</span> = <span style="color: #2d9574;">`Welcome, ${user}!`</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">multiLine</span> = <span style="color: #2d9574;">`Line 1</span>
<span style="color: #2d9574;">Line 2`</span>;

console.log<span style="color: #3a81c3;">(</span>greeting<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"Welcome, Karthik!"</span>
console.log<span style="color: #3a81c3;">(</span>multiLine<span style="color: #3a81c3;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a9c37d" class="outline-4">
<h4 id="org5a9c37d">String Immutability</h4>
<div class="outline-text-4" id="text-org5a9c37d">
<p>
Strings are immutable in JavaScript — operations create a new string.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">original</span> = <span style="color: #2d9574;">"hello"</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">upper</span> = original.toUpperCase<span style="color: #3a81c3;">()</span>;

console.log<span style="color: #3a81c3;">(</span>original<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"hello" (unchanged)</span>
console.log<span style="color: #3a81c3;">(</span>upper<span style="color: #3a81c3;">)</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"HELLO"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org10ec036" class="outline-4">
<h4 id="org10ec036">More Info:</h4>
<div class="outline-text-4" id="text-org10ec036">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String">MDN: String Reference</a></li>
</ul>
</div>
</div>
</div>
