javascript.org
** Boolean DataType
The `Boolean` data type represents one of two values:
- `true`
- `false`

Booleans are commonly used in conditions, logic, and flow control.

- Declaring Booleans

#+begin_src js
let isOnline = true;
let isLoggedIn = false;

console.log(typeof isOnline); // "boolean"
#+end_src

*** Boolean Expressions

Booleans often result from comparisons or logical operations.

#+begin_src js
let a = 10;
let b = 5;

console.log(a > b);       // true
console.log(a === 5);     // false
console.log(a !== b);     // true
#+end_src


*** Boolean Conversion

JavaScript converts other types to boolean in logical contexts (truthy/falsy).

*** Falsy values (convert to false):

- `false`
- `0`, `-0`
- `""` (empty string)
- `null`
- `undefined`
- `NaN`

*** Everything else is truthy:

- `true`, `"0"`, `"false"`, `[]`, `{}`, `function(){}`
- Any non-zero number

#+begin_src js
console.log(Boolean(0));        // false
console.log(Boolean(""));      // false
console.log(Boolean([]));      // true
console.log(Boolean("false")); // true
#+end_src

---

*** Logical Operators (with Booleans)

| Operator | Description         | Example              | Result |
|----------+---------------------+----------------------|--------|
| `&&`     | AND                 | `true && false`      | false  |
| `||`     | OR                  | `false || true`      | true   |
| `!`      | NOT (negation)      | `!true`              | false  |

#+begin_src js
let x = true;
let y = false;

console.log(x && y); // false
console.log(x || y); // true
console.log(!x);     // false
#+end_src

---

*** Boolean Object (Not Recommended)

You can create a Boolean object with `new Boolean()`, but this is rarely used and discouraged because it behaves unexpectedly in conditions.

#+begin_src js
let boolObj = new Boolean(false);
console.log(typeof boolObj);     // "object"
console.log(boolObj == false);   // true
console.log(boolObj === false);  // false
if (boolObj) {
  console.log("Still true!");    // This runs, because objects are truthy
}
#+end_src

Use primitive `true`/`false` values instead of the `Boolean` object.

---

*** Summary Table

| Type        | Value   | Use Case                          |
|-------------+---------+-----------------------------------|
| `boolean`   | `true`  | Condition satisfied               |
|             | `false` | Condition failed                  |
| `Boolean()` | Function to convert any type to boolean     |
| `new Boolean()` | Creates a Boolean object (⚠️ avoid)  |

---

*** More Info:
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures#boolean_type][MDN: Boolean Type]]
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean][MDN: Boolean Object]]

** Null DataType

`null` is an assigned value that represents the intentional absence of any object value.

#+begin_src js
let value = null;
console.log(value);         // null
console.log(typeof value);  // "object" (this is a known quirk in JavaScript)
#+end_src

Use `null` to reset a variable or indicate "empty" data explicitly.

