javascript.html
<div id="outline-container-org5ec6e02" class="outline-3">
<h3 id="org5ec6e02">Boolean DataType</h3>
<div class="outline-text-3" id="text-org5ec6e02">
<p>
The `Boolean` data type represents one of two values:
</p>
<ul class="org-ul">
<li>`true`</li>
<li>`false`</li>
</ul>

<p>
Booleans are commonly used in conditions, logic, and flow control.
</p>

<ul class="org-ul">
<li>Declaring Booleans</li>
</ul>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">isOnline</span> = <span style="color: #4e3163;">true</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">isLoggedIn</span> = <span style="color: #4e3163;">false</span>;

console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> isOnline<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"boolean"</span>
</pre>
</div>
</div>
<div id="outline-container-orga0b0dbc" class="outline-4">
<h4 id="orga0b0dbc">Boolean Expressions</h4>
<div class="outline-text-4" id="text-orga0b0dbc">
<p>
Booleans often result from comparisons or logical operations.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">a</span> = 10;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">b</span> = 5;

console.log<span style="color: #3a81c3;">(</span>a &gt; b<span style="color: #3a81c3;">)</span>;       <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>a === 5<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
console.log<span style="color: #3a81c3;">(</span>a !== b<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge1b8409" class="outline-4">
<h4 id="orge1b8409">Boolean Conversion</h4>
<div class="outline-text-4" id="text-orge1b8409">
<p>
JavaScript converts other types to boolean in logical contexts (truthy/falsy).
</p>
</div>
</div>
<div id="outline-container-orge2d783a" class="outline-4">
<h4 id="orge2d783a">Falsy values (convert to false):</h4>
<div class="outline-text-4" id="text-orge2d783a">
<ul class="org-ul">
<li>`false`</li>
<li>`0`, `-0`</li>
<li>`""` (empty string)</li>
<li>`null`</li>
<li>`undefined`</li>
<li>`NaN`</li>
</ul>
</div>
</div>
<div id="outline-container-org1db5f7a" class="outline-4">
<h4 id="org1db5f7a">Everything else is truthy:</h4>
<div class="outline-text-4" id="text-org1db5f7a">
<ul class="org-ul">
<li>`true`, `"0"`, `"false"`, `[]`, `{}`, `function(){}`</li>
<li>Any non-zero number</li>
</ul>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span>Boolean<span style="color: #6c3163;">(</span>0<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
console.log<span style="color: #3a81c3;">(</span>Boolean<span style="color: #6c3163;">(</span><span style="color: #2d9574;">""</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
console.log<span style="color: #3a81c3;">(</span>Boolean<span style="color: #6c3163;">(</span><span style="color: #2d9574;">[]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;      <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>Boolean<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"false"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
</pre>
</div>

<p>
&#x2014;
</p>
</div>
</div>
<div id="outline-container-org1bd505e" class="outline-4">
<h4 id="org1bd505e">Logical Operators (with Booleans)</h4>
<div class="outline-text-4" id="text-org1bd505e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operator</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Result</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`&amp;&amp;`</td>
<td class="org-left">AND</td>
<td class="org-left">`true &amp;&amp; false`</td>
<td class="org-left">false</td>
</tr>

<tr>
<td class="org-left">`</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">`</td>
<td class="org-left">OR</td>
<td class="org-left">`false</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">true`</td>
<td class="org-left">true</td>
</tr>

<tr>
<td class="org-left">`!`</td>
<td class="org-left">NOT (negation)</td>
<td class="org-left">`!true`</td>
<td class="org-left">false</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">x</span> = <span style="color: #4e3163;">true</span>;
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">y</span> = <span style="color: #4e3163;">false</span>;

console.log<span style="color: #3a81c3;">(</span>x &amp;&amp; y<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
console.log<span style="color: #3a81c3;">(</span>x || y<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>!x<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
</pre>
</div>

<p>
&#x2014;
</p>
</div>
</div>
<div id="outline-container-orgbdc0094" class="outline-4">
<h4 id="orgbdc0094">Boolean Object (Not Recommended)</h4>
<div class="outline-text-4" id="text-orgbdc0094">
<p>
You can create a Boolean object with `new Boolean()`, but this is rarely used and discouraged because it behaves unexpectedly in conditions.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">boolObj</span> = <span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">Boolean</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">false</span><span style="color: #3a81c3;">)</span>;
console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> boolObj<span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"object"</span>
console.log<span style="color: #3a81c3;">(</span>boolObj == <span style="color: #4e3163;">false</span><span style="color: #3a81c3;">)</span>;   <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
console.log<span style="color: #3a81c3;">(</span>boolObj === <span style="color: #4e3163;">false</span><span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false</span>
<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>boolObj<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
  console.log<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Still true!"</span><span style="color: #6c3163;">)</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">This runs, because objects are truthy</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Use primitive `true`/`false` values instead of the `Boolean` object.
</p>

<p>
&#x2014;
</p>
</div>
</div>
<div id="outline-container-org0296144" class="outline-4">
<h4 id="org0296144">Summary Table</h4>
<div class="outline-text-4" id="text-org0296144">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Use Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`boolean`</td>
<td class="org-left">`true`</td>
<td class="org-left">Condition satisfied</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">`false`</td>
<td class="org-left">Condition failed</td>
</tr>

<tr>
<td class="org-left">`Boolean()`</td>
<td class="org-left">Function to convert any type to boolean</td>
</tr>

<tr>
<td class="org-left">`new Boolean()`</td>
<td class="org-left">Creates a Boolean object (⚠️ avoid)</td>
</tr>
</tbody>
</table>

<p>
&#x2014;
</p>
</div>
</div>
<div id="outline-container-org80e9389" class="outline-4">
<h4 id="org80e9389">More Info:</h4>
<div class="outline-text-4" id="text-org80e9389">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Data_structures#boolean_type">MDN: Boolean Type</a></li>
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean">MDN: Boolean Object</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org43c4f5e" class="outline-3">
<h3 id="org43c4f5e">Null DataType</h3>
<div class="outline-text-3" id="text-org43c4f5e">
<p>
`null` is an assigned value that represents the intentional absence of any object value.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">value</span> = <span style="color: #4e3163;">null</span>;
console.log<span style="color: #3a81c3;">(</span>value<span style="color: #3a81c3;">)</span>;         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">null</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> value<span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"object" (this is a known quirk in JavaScript)</span>
</pre>
</div>

<p>
Use `null` to reset a variable or indicate "empty" data explicitly.
</p>
</div>
</div>
