javascript.org
** Undefined DatType

`undefined` means a variable has been declared but not assigned a value.

#+begin_src js
let notAssigned;
console.log(notAssigned);       // undefined
console.log(typeof notAssigned); // "undefined"
#+end_src

When comparing `null` and `undefined`:

#+begin_src js
console.log(null == undefined);  // true (loose equality)
console.log(null === undefined); // false (strict equality)
#+end_src

---

** Object DataType

Objects are key-value pairs used to store structured data.

#+begin_src js
let person = {
  name: "Alice",
  age: 30,
  isStudent: false
};

// Accessing values
console.log(person.name);       // "Alice"
console.log(person["age"]);     // 30

// Adding new property
person.country = "India";

// Deleting a property
delete person.isStudent;
#+end_src

***  Object Methods

| Method                    | Description                           |
|---------------------------+---------------------------------------|
| `Object.keys(obj)`        | Returns an array of keys              |
| `Object.values(obj)`      | Returns an array of values            |
| `Object.entries(obj)`     | Returns an array of key-value pairs   |
| `hasOwnProperty("key")`   | Checks if object contains the key     |

#+begin_src js
console.log(Object.keys(person));    // ["name", "age", "country"]
console.log(Object.values(person));  // ["Alice", 30, "India"]
console.log(person.hasOwnProperty("name")); // true
#+end_src

Objects can also contain functions:

#+begin_src js
let calculator = {
  add: function(a, b) {
    return a + b;
  }
};

console.log(calculator.add(2, 3)); // 5
#+end_src
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object][MDN: Object]]

** Array DataType

Arrays are ordered collections of values (indexed from 0). Arrays are objects in JavaScript.

#+begin_src js
let fruits = ["Apple", "Banana", "Cherry"];
console.log(fruits[0]);    // "Apple"
console.log(fruits.length); // 3
#+end_src



*** Array Methods

| Method            | Description                             |
|-------------------+-----------------------------------------|
| `push()`          | Add to end                              |
| `pop()`           | Remove from end                         |
| `shift()`         | Remove from beginning                   |
| `unshift()`       | Add to beginning                        |
| `splice()`        | Add/remove elements                     |
| `slice()`         | Get subarray                            |
| `join()`          | Join array to string                    |
| `indexOf()`       | Get index of element                    |
| `includes()`      | Check if value exists                   |
| `forEach()`       | Loop over elements                      |
| `map()`           | Create new array by applying function   |
| `filter()`        | Filter elements by condition            |

#+begin_src js
let numbers = [1, 2, 3, 4, 5];

let doubled = numbers.map(n => n * 2);    // [2, 4, 6, 8, 10]
let evens = numbers.filter(n => n % 2 === 0); // [2, 4]

numbers.forEach(n => console.log(n));     // Logs each number
#+end_src


- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array][MDN: Array]]
