javascript.html
<div id="outline-container-orgae2521c" class="outline-3">
<h3 id="orgae2521c">Undefined DatType</h3>
<div class="outline-text-3" id="text-orgae2521c">
<p>
`undefined` means a variable has been declared but not assigned a value.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">notAssigned</span>;
console.log<span style="color: #3a81c3;">(</span>notAssigned<span style="color: #3a81c3;">)</span>;       <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">undefined</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> notAssigned<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"undefined"</span>
</pre>
</div>

<p>
When comparing `null` and `undefined`:
</p>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">null</span> == <span style="color: #4e3163;">undefined</span><span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true (loose equality)</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">null</span> === <span style="color: #4e3163;">undefined</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">false (strict equality)</span>
</pre>
</div>

<p>
&#x2014;
</p>
</div>
</div>
<div id="outline-container-org16ee79c" class="outline-3">
<h3 id="org16ee79c">Object DataType</h3>
<div class="outline-text-3" id="text-org16ee79c">
<p>
Objects are key-value pairs used to store structured data.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span>
  name: <span style="color: #2d9574;">"Alice"</span>,
  age: 30,
  isStudent: <span style="color: #4e3163;">false</span>
<span style="color: #3a81c3;">}</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Accessing values</span>
console.log<span style="color: #3a81c3;">(</span>person.name<span style="color: #3a81c3;">)</span>;       <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"Alice"</span>
console.log<span style="color: #3a81c3;">(</span>person<span style="color: #6c3163;">[</span><span style="color: #2d9574;">"age"</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">30</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Adding new property</span>
person.country = <span style="color: #2d9574;">"India"</span>;

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Deleting a property</span>
<span style="color: #3a81c3; font-weight: bold;">delete</span> person.isStudent;
</pre>
</div>
</div>
<div id="outline-container-orgf077903" class="outline-4">
<h4 id="orgf077903">Object Methods</h4>
<div class="outline-text-4" id="text-orgf077903">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`Object.keys(obj)`</td>
<td class="org-left">Returns an array of keys</td>
</tr>

<tr>
<td class="org-left">`Object.values(obj)`</td>
<td class="org-left">Returns an array of values</td>
</tr>

<tr>
<td class="org-left">`Object.entries(obj)`</td>
<td class="org-left">Returns an array of key-value pairs</td>
</tr>

<tr>
<td class="org-left">`hasOwnProperty("key")`</td>
<td class="org-left">Checks if object contains the key</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span>Object.keys<span style="color: #6c3163;">(</span>person<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">["name", "age", "country"]</span>
console.log<span style="color: #3a81c3;">(</span>Object.values<span style="color: #6c3163;">(</span>person<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">["Alice", 30, "India"]</span>
console.log<span style="color: #3a81c3;">(</span>person.hasOwnProperty<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"name"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
</pre>
</div>

<p>
Objects can also contain functions:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">calculator</span> = <span style="color: #3a81c3;">{</span>
  <span style="color: #6c3163; font-weight: bold;">add</span>: <span style="color: #3a81c3; font-weight: bold;">function</span><span style="color: #6c3163;">(</span><span style="color: #715ab1;">a</span>, <span style="color: #715ab1;">b</span><span style="color: #6c3163;">)</span> <span style="color: #6c3163;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> a + b;
  <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>;

console.log<span style="color: #3a81c3;">(</span>calculator.add<span style="color: #6c3163;">(</span>2, 3<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">5</span>
</pre>
</div>
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object">MDN: Object</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org685aed8" class="outline-3">
<h3 id="org685aed8">Array DataType</h3>
<div class="outline-text-3" id="text-org685aed8">
<p>
Arrays are ordered collections of values (indexed from 0). Arrays are objects in JavaScript.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">fruits</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"Apple"</span>, <span style="color: #2d9574;">"Banana"</span>, <span style="color: #2d9574;">"Cherry"</span><span style="color: #3a81c3;">]</span>;
console.log<span style="color: #3a81c3;">(</span>fruits<span style="color: #6c3163;">[</span>0<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"Apple"</span>
console.log<span style="color: #3a81c3;">(</span>fruits.length<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">3</span>
</pre>
</div>
</div>
<div id="outline-container-org1774e9d" class="outline-4">
<h4 id="org1774e9d">Array Methods</h4>
<div class="outline-text-4" id="text-org1774e9d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Method</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`push()`</td>
<td class="org-left">Add to end</td>
</tr>

<tr>
<td class="org-left">`pop()`</td>
<td class="org-left">Remove from end</td>
</tr>

<tr>
<td class="org-left">`shift()`</td>
<td class="org-left">Remove from beginning</td>
</tr>

<tr>
<td class="org-left">`unshift()`</td>
<td class="org-left">Add to beginning</td>
</tr>

<tr>
<td class="org-left">`splice()`</td>
<td class="org-left">Add/remove elements</td>
</tr>

<tr>
<td class="org-left">`slice()`</td>
<td class="org-left">Get subarray</td>
</tr>

<tr>
<td class="org-left">`join()`</td>
<td class="org-left">Join array to string</td>
</tr>

<tr>
<td class="org-left">`indexOf()`</td>
<td class="org-left">Get index of element</td>
</tr>

<tr>
<td class="org-left">`includes()`</td>
<td class="org-left">Check if value exists</td>
</tr>

<tr>
<td class="org-left">`forEach()`</td>
<td class="org-left">Loop over elements</td>
</tr>

<tr>
<td class="org-left">`map()`</td>
<td class="org-left">Create new array by applying function</td>
</tr>

<tr>
<td class="org-left">`filter()`</td>
<td class="org-left">Filter elements by condition</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">numbers</span> = <span style="color: #3a81c3;">[</span>1, 2, 3, 4, 5<span style="color: #3a81c3;">]</span>;

<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">doubled</span> = numbers.map<span style="color: #3a81c3;">(</span>n =&gt; n * 2<span style="color: #3a81c3;">)</span>;    <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[2, 4, 6, 8, 10]</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">evens</span> = numbers.filter<span style="color: #3a81c3;">(</span>n =&gt; n % 2 === 0<span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">[2, 4]</span>

numbers.forEach<span style="color: #3a81c3;">(</span>n =&gt; console.log<span style="color: #6c3163;">(</span>n<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;     <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Logs each number</span>
</pre>
</div>


<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array">MDN: Array</a></li>
</ul>
</div>
</div>
</div>
