javascript.org
** Check Data Type

#+begin_src js
console.log(typeof null);              // "object" (legacy bug)
console.log(typeof undefined);         // "undefined"
console.log(typeof {});                // "object"
console.log(typeof []);                // "object" (Array is a type of object)
console.log(Array.isArray([]));        // true
#+end_src






** Summary

| Type       | Description                               |
|------------+-------------------------------------------|
| `null`     | Explicitly empty, value placeholder       |
| `undefined`| Variable declared but not yet assigned    |
| `object`   | Key-value pair structure for complex data |
| `array`    | Ordered list of values (indexed object)   |






* Functions

#+begin_src js
// Function Declaration
function greet(name) {
    return "Hello, " + name;
}

// Arrow Function
const add = (a, b) => a + b;
#+end_src

* Control Flow

#+begin_src js
let score = 85;

if (score >= 90) {
    console.log("Grade: A");
} else if (score >= 80) {
    console.log("Grade: B");
} else {
    console.log("Grade: C or lower");
}
#+end_src

* Loops

#+begin_src js
// For loop
for (let i = 0; i < 5; i++) {
    console.log("i =", i);
}

// While loop
let j = 0;
while (j < 5) {
    console.log("j =", j);
    j++;
}
#+end_src

* Objects and Arrays

#+begin_src js
let person = {
    name: "Bob",
    age: 30,
    greet: function () {
        console.log("Hi, I'm " + this.name);
    }
};

person.greet();

let fruits = ["Apple", "Banana", "Cherry"];
console.log(fruits[1]); // Banana
#+end_src

* TODO DOM Manipulation (in browser)

#+begin_src html
<!-- HTML -->
<button onclick="changeText()">Click Me</button>
<p id="demo">Hello!</p>

<script>
function changeText() {
    document.getElementById("demo").innerHTML = "Text changed!";
}
</script>
#+end_src

* TODO Events

#+begin_src js
document.getElementById("btn").addEventListener("click", function() {
    alert("Button clicked!");
});
#+end_src

* TODO Local Storage
JavaScript Tutorial In Hindi (CodeWithHarry) : https://www.youtube.com/watch?v=hKB-YGF14SY
* Conclusion

You’ve now seen the basics of JavaScript including variables, control flow, functions, arrays, objects, and simple DOM interactions. For more, check:
- [[https://developer.mozilla.org/en-US/docs/Web/JavaScript][MDN JavaScript Docs]]
- [[https://javascript.info][javascript.info]]
