javascript.html
<div id="outline-container-orgd136656" class="outline-3">
<h3 id="orgd136656">Check Data Type</h3>
<div class="outline-text-3" id="text-orgd136656">
<div class="org-src-container">
<pre class="src src-js">console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> <span style="color: #4e3163;">null</span><span style="color: #3a81c3;">)</span>;              <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"object" (legacy bug)</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> <span style="color: #4e3163;">undefined</span><span style="color: #3a81c3;">)</span>;         <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"undefined"</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> <span style="color: #6c3163;">{}</span><span style="color: #3a81c3;">)</span>;                <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"object"</span>
console.log<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">typeof</span> <span style="color: #6c3163;">[]</span><span style="color: #3a81c3;">)</span>;                <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"object" (Array is a type of object)</span>
console.log<span style="color: #3a81c3;">(</span>Array.isArray<span style="color: #6c3163;">(</span><span style="color: #2d9574;">[]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>;        <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">true</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcadbae9" class="outline-3">
<h3 id="orgcadbae9">Summary</h3>
<div class="outline-text-3" id="text-orgcadbae9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">`null`</td>
<td class="org-left">Explicitly empty, value placeholder</td>
</tr>

<tr>
<td class="org-left">`undefined`</td>
<td class="org-left">Variable declared but not yet assigned</td>
</tr>

<tr>
<td class="org-left">`object`</td>
<td class="org-left">Key-value pair structure for complex data</td>
</tr>

<tr>
<td class="org-left">`array`</td>
<td class="org-left">Ordered list of values (indexed object)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org7aea051" class="outline-2">
<h2 id="org7aea051">Functions</h2>
<div class="outline-text-2" id="text-org7aea051">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Function Declaration</span>
<span style="color: #3a81c3; font-weight: bold;">function</span> <span style="color: #6c3163; font-weight: bold;">greet</span><span style="color: #3a81c3;">(</span><span style="color: #715ab1;">name</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">"Hello, "</span> + name;
<span style="color: #3a81c3;">}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Arrow Function</span>
<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #715ab1;">add</span> = <span style="color: #3a81c3;">(</span>a, b<span style="color: #3a81c3;">)</span> =&gt; a + b;
</pre>
</div>
</div>
</div>
<div id="outline-container-org0593383" class="outline-2">
<h2 id="org0593383">Control Flow</h2>
<div class="outline-text-2" id="text-org0593383">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">score</span> = 85;

<span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>score &gt;= 90<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    console.log<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Grade: A"</span><span style="color: #6c3163;">)</span>;
<span style="color: #3a81c3;">}</span> <span style="color: #3a81c3; font-weight: bold;">else</span> <span style="color: #3a81c3; font-weight: bold;">if</span> <span style="color: #3a81c3;">(</span>score &gt;= 80<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    console.log<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Grade: B"</span><span style="color: #6c3163;">)</span>;
<span style="color: #3a81c3;">}</span> <span style="color: #3a81c3; font-weight: bold;">else</span> <span style="color: #3a81c3;">{</span>
    console.log<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"Grade: C or lower"</span><span style="color: #6c3163;">)</span>;
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9bf4768" class="outline-2">
<h2 id="org9bf4768">Loops</h2>
<div class="outline-text-2" id="text-org9bf4768">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">For loop</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">i</span> = 0; i &lt; 5; i++<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    console.log<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"i ="</span>, i<span style="color: #6c3163;">)</span>;
<span style="color: #3a81c3;">}</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">While loop</span>
<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">j</span> = 0;
<span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #3a81c3;">(</span>j &lt; 5<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3;">{</span>
    console.log<span style="color: #6c3163;">(</span><span style="color: #2d9574;">"j ="</span>, j<span style="color: #6c3163;">)</span>;
    j++;
<span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4c4cb99" class="outline-2">
<h2 id="org4c4cb99">Objects and Arrays</h2>
<div class="outline-text-2" id="text-org4c4cb99">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">person</span> = <span style="color: #3a81c3;">{</span>
    name: <span style="color: #2d9574;">"Bob"</span>,
    age: 30,
    <span style="color: #6c3163; font-weight: bold;">greet</span>: <span style="color: #3a81c3; font-weight: bold;">function</span> <span style="color: #6c3163;">()</span> <span style="color: #6c3163;">{</span>
        console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Hi, I'm "</span> + <span style="color: #4e3163;">this</span>.name<span style="color: #2d9574;">)</span>;
    <span style="color: #6c3163;">}</span>
<span style="color: #3a81c3;">}</span>;

person.greet<span style="color: #3a81c3;">()</span>;

<span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">fruits</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">"Apple"</span>, <span style="color: #2d9574;">"Banana"</span>, <span style="color: #2d9574;">"Cherry"</span><span style="color: #3a81c3;">]</span>;
console.log<span style="color: #3a81c3;">(</span>fruits<span style="color: #6c3163;">[</span>1<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Banana</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org863ce1d" class="outline-2">
<h2 id="org863ce1d"><span class="todo TODO">TODO</span> DOM Manipulation (in browser)</h2>
<div class="outline-text-2" id="text-org863ce1d">
<div class="org-src-container">
<pre class="src src-html"><span style="color: #2aa1ae; background-color: #ecf3ec;">&lt;!-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">HTML</span><span style="color: #2aa1ae; background-color: #ecf3ec;"> --&gt;</span>
&lt;<span style="color: #6c3163; font-weight: bold;">button</span> <span style="color: #715ab1;">onclick</span>=<span style="color: #2d9574;">"changeText()"</span>&gt;Click Me&lt;/<span style="color: #6c3163; font-weight: bold;">button</span>&gt;
&lt;<span style="color: #6c3163; font-weight: bold;">p</span> <span style="color: #715ab1;">id</span>=<span style="color: #2d9574;">"demo"</span>&gt;Hello!&lt;/<span style="color: #6c3163; font-weight: bold;">p</span>&gt;

&lt;<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
function changeText() {
    document.getElementById("demo").innerHTML = "Text changed!";
}
&lt;/<span style="color: #6c3163; font-weight: bold;">script</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcb69df5" class="outline-2">
<h2 id="orgcb69df5"><span class="todo TODO">TODO</span> Events</h2>
<div class="outline-text-2" id="text-orgcb69df5">
<div class="org-src-container">
<pre class="src src-js">document.getElementById<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"btn"</span><span style="color: #3a81c3;">)</span>.addEventListener<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">"click"</span>, <span style="color: #3a81c3; font-weight: bold;">function</span><span style="color: #6c3163;">()</span> <span style="color: #6c3163;">{</span>
    alert<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"Button clicked!"</span><span style="color: #2d9574;">)</span>;
<span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org0dc9d77" class="outline-2">
<h2 id="org0dc9d77"><span class="todo TODO">TODO</span> Local Storage</h2>
<div class="outline-text-2" id="text-org0dc9d77">
<p>
JavaScript Tutorial In Hindi (CodeWithHarry) : <a href="https://www.youtube.com/watch?v=hKB-YGF14SY">https://www.youtube.com/watch?v=hKB-YGF14SY</a>
</p>
</div>
</div>
<div id="outline-container-orge651afe" class="outline-2">
<h2 id="orge651afe">Conclusion</h2>
<div class="outline-text-2" id="text-orge651afe">
<p>
You’ve now seen the basics of JavaScript including variables, control flow, functions, arrays, objects, and simple DOM interactions. For more, check:
</p>
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript">MDN JavaScript Docs</a></li>
<li><a href="https://javascript.info">javascript.info</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Your Name Karthik D</p>
<p class="date">Created: 2025-08-02 Sat 11:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
